01-ahmed-body/cases/slant10_re4.18M_symtest/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
forces
{
    type            forceCoeffs;
    libs            ("libforces.so");
    writeControl    timeStep;
    writeInterval   1;

    patches         ("ahmedBody");

    // rhoInf is a required placeholder for incompressible cases --
    // its value is ignored (coefficients use kinematic pressure p/rho
    // directly). Verified against OpenFOAM source documentation, not
    // assumed. See mesh_development_log.md.
    rho             rhoInf;
    rhoInf          1;
    log             true;

    liftDir         (0 0 1);
    dragDir         (1 0 0);
    pitchAxis       (0 1 0);

    // Geometric center of the Ahmed body (placed coordinates), used
    // as moment reference. Does not affect Cd/Cl (force coefficients),
    // only moment coefficients.
    CofR            (0.522 0 0.194);

    magUInf         60;
    lRef            1.044;

    // Frontal (cross-sectional) area = width x height, the standard
    // Ahmed body Cd reference area (A_x = H*W), confirmed against
    // literature (e.g. arxiv.org/pdf/1310.6285).
    Aref            0.112032;
}
// ************************************************************************* //
